import pickle
from sklearn.feature_extraction.text import TfidfVectorizer

train_data = ['고소한', '달큰한', '레시피', '소스를', '곁들인', '입에', '착', '감기는', '쫄깃함', '향긋한', '시소잎을',  '돌돌', '가쓰오', '다시로', 
              '맛을', '낸', '빵가루를', '묻혀', '튀겨낸', '면과', '함께', '즐기는', '건강식',  '담백하고', '개운한', '수박의', '흰', '부분을', '이용한', 
              '갖은', '재료를', '올린', '구수하고', '노른자에',  '찍어먹는', '별미', '일식의', '기본', '국물요리', 'LG', '인덕션', '<짱구는', '못', '말려>', 
              '라면',  '폴킴이', '알려주는', '탱글탱글!', '차가운', '면발!', '깔끔하면서', '상큼한', '견과류를', '넣어', '초간단',  '혼밥', '메뉴!', '색다른', 
              '조림요리', '고급스러운', '비주얼', '겨울', '간식', '최강자', '근사하고', '정갈한',  '한', '끼', '호호~불어가며', '먹는', '보기만해도', '행복해지는', 
              '식감', '살려', '더욱', '맛있어요', '풍부한',  '치즈맛에', '퐁당', '간단하지만', '폼나는', '비린내', '없이', '깔끔한', '부드럽고', '진한', '맛', 
              '보약이',  '따로', '필요없는', '속을', '가득', '채우는', '든든함', '토마토향', '첫', '숟가락부터', '반하게', '될',  '가츠오부시가', '춤추는', 
              '육즙', 
              '가득한', '겉은', '바삭', '속은', '부드러운', '녹차의', '향기', '싣고']


# TfidfVectorizer 학습
vectorizer = TfidfVectorizer()
vectorizer.fit(train_data)

# 벡터라이저를 파일로 저장 (경로를 원하는 위치로 변경 가능)
vectorizer_path = r'C:\Hwan\Application_WEB\project\WordDict\vectorizer.pkl'
with open(vectorizer_path, 'wb') as f:
    pickle.dump(vectorizer, f)

print("TfidfVectorizer has been saved successfully.")
